replace ascii maps with mermaid
